local ls = require("luasnip")
local s = ls.snippet
local i = ls.insert_node
local t = ls.text_node

return {
  s("dothead", {
    t({
      "# ──────────────────────────────────────────────────────────",
      "#  ദി(˵ •̀ ᴗ - ˵ ) ✧  @d1rshan | dotfiles",
      "#",
      "#  「✦ ",
    }),
    i(1, "TITLE"),
    t({
      " ✦ 」",
      "#",
      "# ──────────────────────────────────────────────────────────",
      "",
    }),
  }),

  s("dotsec", {
    t({
      "",
      "# ── 「 ",
    }),
    i(1, "SECTION"),
    t({
      " 」 ─────────────────────────────────────────────",
      "",
    }),
  }),
}
